# Project 3 Alternate Assignment
### Given a text file with structured table information, manipulate the data while creating a Jupyter Notebook that generates a .CSV file with meaningful information. 
### I have chosen a text file which contains salary data for men and women. The data is somewhat structured in a table format, but with a few complications that we'll have to work out first. 
### First we will read in the text file. One of the problems with the data is the columns are separated only by spaces, and not by the same number of spaces. So when we read in the data, I use delimiter=r"\s+" so that the separator is any amount of white space.

In [64]:
import pandas as pd

data = pd.read_csv('salarygapdata.txt', header=None, delimiter=r"\s+")
data.head()

        0     1   2          3   4      5
0      sx    rk  yr         dg  yd     sl
1    male  full  25  doctorate  35  36350
2    male  full  13  doctorate  22  35350
3    male  full  10  doctorate  23  28200
4  female  full   7  doctorate  27  26775

### As you can see above, I have successfully separated the columns, but now my columns are only index numbers. So next I will rename the columns, and delete that first row.

In [65]:
data.columns = ['Gender', 'Rank', 'Years_in_Rank', 'Degree', 'Degree_Age', 'Salary']
data.drop([0], inplace=True)
data.head()

   Gender  Rank Years_in_Rank     Degree Degree_Age Salary
1    male  full            25  doctorate         35  36350
2    male  full            13  doctorate         22  35350
3    male  full            10  doctorate         23  28200
4  female  full             7  doctorate         27  26775
5    male  full            19    masters         30  33696

### Now we can start to work with the data. However, in order to manipulate the numerical field, we have to convert the data type from object to int. Here we confirm, the Salary column has been stored as an object. Next we convert the values to the integer data type.

In [66]:
data.Salary.head()

1    36350
2    35350
3    28200
4    26775
5    33696
Name: Salary, dtype: object

In [67]:
#convert the salary column to data type int
data['Salary'] = data['Salary'].apply(pd.to_numeric)
data.Salary.head()

1    36350
2    35350
3    28200
4    26775
5    33696
Name: Salary, dtype: int64

In [68]:
#do the same for other numeric fields
data['Years_in_Rank'] = data['Years_in_Rank'].apply(pd.to_numeric)
data['Degree_Age'] = data['Degree_Age'].apply(pd.to_numeric)

### Now add a new column which compares data in the table. The Experience column now shows a range for each individual's years of experience.

In [69]:
data['Experience'] = np.where(data['Years_in_Rank']<=10, '0-10yrs', '10-25yrs')
data.head()

   Gender  Rank  Years_in_Rank     Degree  Degree_Age  Salary Experience
1    male  full             25  doctorate          35   36350   10-25yrs
2    male  full             13  doctorate          22   35350   10-25yrs
3    male  full             10  doctorate          23   28200    0-10yrs
4  female  full              7  doctorate          27   26775    0-10yrs
5    male  full             19    masters          30   33696   10-25yrs

### Write the data to a new .csv file and read in the new file.

In [76]:
data.to_csv('SalaryData.csv')

In [77]:
#read in the csv file
newfile = pd.read_csv('SalaryData.csv')

### Compare some data in the new .csv file. What's the average salary by Gender, Rank, and Degree level.

In [79]:
newfile.groupby(['Rank','Gender', 'Degree', ]).Salary.mean()

Rank       Gender  Degree
assistant  female  doctorate    17005.714286
                   masters      21600.000000
           male    doctorate    16901.142857
                   masters      20296.000000
associate  female  masters      21570.000000
           male    doctorate    23246.200000
                   masters      23584.571429
full       female  doctorate    30106.666667
                   masters      24900.000000
           male    doctorate    29592.750000
                   masters      30711.500000
Name: Salary, dtype: float64

### Compare the average salary by Gender, Degree, and years of experience. Interesting note: there is no data for females with more than 10 years of experience. This could be due to popular statistics that female representation drops off as you look at higher positions. Or it could be due to the small size of the dataset.

In [84]:
newfile.groupby(['Gender', 'Degree', 'Experience', ]).Salary.mean()

Gender  Degree     Experience
female  doctorate  0-10yrs       20936.000000
        masters    0-10yrs       22410.000000
male    doctorate  0-10yrs       21864.875000
                   10-25yrs      29976.750000
        masters    0-10yrs       22901.625000
                   10-25yrs      27602.166667
Name: Salary, dtype: float64